mongo/1node/load-c.log
Loading workload...
Starting test.
2024-04-10 01:28:15:621 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://10.142.0.4:27017/ycsb
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2024-04-10 01:28:22:342 6 sec: 1000 operations; 230.52 current ops/sec; [CLEANUP: Count=1, Max=3003, Min=3002, Avg=3003, 90=3003, 99=3003, 99.9=3003, 99.99=3003] [INSERT: Count=1000, Max=1455535, Min=726, Avg=3250.93, 90=4879, 99=6851, 99.9=10791, 99.99=15535] 
[OVERALL], RunTime(ms), 4338
[OVERALL], Throughput(ops/sec), 230.52097740894422
[TOTAL_GCS_G1_Young_Generation], Count, 4
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 47
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.083485938220377
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 4
[TOTAL_GC_TIME], Time(ms), 47
[TOTAL_GC_TIME_%], Time(%), 1.083485938220377
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3003.0
[CLEANUP], MinLatency(us), 3002
[CLEANUP], MaxLatency(us), 3003
[CLEANUP], 95thPercentileLatency(us), 3003
[CLEANUP], 99thPercentileLatency(us), 3003
[INSERT], Operations, 1000
[INSERT], AverageLatency(us), 3250.927
[INSERT], MinLatency(us), 726
[INSERT], MaxLatency(us), 145535
[INSERT], 95thPercentileLatency(us), 5451
[INSERT], 99thPercentileLatency(us), 3520
[INSERT], Return=OK, 1000