mongo/1node/load-d.log
Loading workload...
Starting test.
2024-04-10 01:29:44:296 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://10.142.0.4:27017/ycsb
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2024-04-10 01:29:51:017 6 sec: 1000 operations; 233.97 current ops/sec; [CLEANUP: Count=1, Max=2499, Min=2498, Avg=2499, 90=2499, 99=2499, 99.9=2499, 99.99=2499] [INSERT: Count=1000, Max=123007, Min=733, Avg=3157.95, 90=4727, 99=6115, 99.9=9599, 99.99=123007] 
[OVERALL], RunTime(ms), 4277
[OVERALL], Throughput(ops/sec), 233.80874444704233
[TOTAL_GCS_G1_Young_Generation], Count, 4
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 43
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.005377601122282
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 4
[TOTAL_GC_TIME], Time(ms), 43
[TOTAL_GC_TIME_%], Time(%), 1.005377601122282
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2499.0
[CLEANUP], MinLatency(us), 2498
[CLEANUP], MaxLatency(us), 2499
[CLEANUP], 95thPercentileLatency(us), 2499
[CLEANUP], 99thPercentileLatency(us), 2499
[INSERT], Operations, 1000
[INSERT], AverageLatency(us), 3157.949
[INSERT], MinLatency(us), 733
[INSERT], MaxLatency(us), 123007
[INSERT], 95thPercentileLatency(us), 5207
[INSERT], 99thPercentileLatency(us), 6115
[INSERT], Return=OK, 1000