mongo/1node/load-e.log
[OVERALL], RunTime(ms), 4432
[OVERALL], Throughput(ops/sec), 225.6317689530686
[TOTAL_GCS_G1_Young_Generation], Count, 4
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 45
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.0153429602888087
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 4
[TOTAL_GC_TIME], Time(ms), 45
[TOTAL_GC_TIME_%], Time(%), 1.0153429602888087
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2543.0
[CLEANUP], MinLatency(us), 2542
[CLEANUP], MaxLatency(us), 2543
[CLEANUP], 95thPercentileLatency(us), 2543
[CLEANUP], 99thPercentileLatency(us), 2543
[INSERT], Operations, 1000
[INSERT], AverageLatency(us), 3311.32
[INSERT], MinLatency(us), 732
[INSERT], MaxLatency(us), 130111
[INSERT], 95thPercentileLatency(us), 5431
[INSERT], 99thPercentileLatency(us), 6303
[INSERT], Return=OK, 1000